gpg-backup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-06 Sun 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>backing up and syncing gpg keys</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">backing up and syncing gpg keys</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. public keyring, and "non-exportable" stuff</a>
<ul>
<li><a href="#org0000001">1.1. to a file</a></li>
<li><a href="#org0000002">1.2. directly over ssh</a></li>
</ul>
</li>
<li><a href="#org0000003">2. trust values</a>
<ul>
<li><a href="#org0000004">2.1. to a file</a></li>
<li><a href="#org0000005">2.2. directly over ssh</a></li>
</ul>
</li>
<li><a href="#org0000006">3. secret keys</a>
<ul>
<li><a href="#org0000007">3.1. just the subkeys</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> public keyring, and "non-exportable" stuff</h2>
<div class="outline-text-2" id="text-1">
<p>
this includes local signatures
</p>
</div>

<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> to a file</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example" id="org0000008">
gpg --export --export-options export-backup file
...
gpg --import --import-options import-restore file
</pre>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> directly over ssh</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example" id="org0000008">
gpg --export --export-options export-backup | ssh user@host -- gpg --import --import-options import-restore
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">2.</span> trust values</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">2.1.</span> to a file</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example" id="org0000008">
gpg --export-ownertrust file
...
gpg --import-ownertrust file
</pre>
</div>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">2.2.</span> directly over ssh</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example" id="org0000008">
gpg --export-ownertrust | ssh user@host -- gpg --import-ownertrust
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000006" class="outline-2">
<h2 id="org0000006"><span class="section-number-2">3.</span> secret keys</h2>
<div class="outline-text-2" id="text-3">
<p>
note that since importing a password-protected secret key asks for the
password, it is difficult to do while piping over ssh.
</p>

<pre class="example" id="org0000008">
gpg --export-secret-keys file
...
gpg --import file
</pre>
</div>

<div id="outline-container-org0000007" class="outline-3">
<h3 id="org0000007"><span class="section-number-3">3.1.</span> just the subkeys</h3>
<div class="outline-text-3" id="text-3-1">
<p>
you can instead share only the secret subkeys with a less-trustworthy
computer (such as a laptop you take with you) so that you can revoke
them and create new subkeys, without the hassle of your entire key
needing to be revoked.
</p>

<pre class="example" id="org0000008">
gpg --export-secret-subkeys file
...
gpg --import file
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
